import React, { useState } from "react";

const Card = () => {
  const quotes = ["لا تدري لعل الله يحدث بعد ذلك أمرا", 
  "لله نحن و الموج و السفن", 
  "حتى لا تكون آفة حارتنا النسيان",
  "أن تتوقع أن يعاملك العالم برفق لأنك إنسان طيب، أشبه بأن تتوقع ألا يلتهمك الأسد لأنك نباتي لا تأكل اللحوم.",
  "الحل الوحيد للمشاكل النفسية هو: لا تكن عاطلاً، لا تكن وحيدًا.",
  "لو كان بوسع المرء أن يغرس خنجرًا في مخه ليقتطع الجزء الذي يحمل ذكريات معينة، لغدت الحياة جنة.",
  "الاكتئاب مرض لعين، والأدهى أنه يتطلب قدرًا كبيرا من الذكاء والحساسية لدى المريض كي يصاب به.",
  "كل الأشياء السيئة تحدث في نفس الوقت، في نفس اليوم، في نفس الساعة.",
  "هناك جريمة شنعاء تستأهل أعنف العذاب في هذا العالم، وهي جريمة أن تكون مختلفًا.",
  "أريد أن أجمع قدرًا من المال يكفي لعلاج الأمراض التي أصابتني أثناء جمعه.",
  "كيف تقلق و الله هو مدبر أمرك",
  "مرة واحد قعد على قهوة قعد على شاي",
  "فبأي الآء ربكما تكذبان",
  "كل من عليها فان ويبقى وجه ربك ذو الجلال و الإكرام"
];

  const change = () => {
    const i = Math.floor(Math.random() * quotes.length);
    const txt = quotes[i];
    
    console.log(`Quote is :${txt}`);

    setquote(txt);
  };

  const [quote, setquote] = useState("ًمساء الخير على أهل الخير");

  return (
    <>
      <div className="card">
        <p>{quote}</p>
        <div className="btns">
          <button>love</button>
          <button onClick={change}>next</button>
        </div>
      </div>
    </>
  );
};

export default Card;
